In [1]:
import pandas as pd
df = pd.read_csv(r"C:\\Users\Natan\\OneDrive\\Documents\\Victor-projects\\projetos_python\\Data_analysis\\salaries-mls\\2011\\mls-salaries-2011.csv")
df

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,COL,Ababio,Eddie,D,32604.0,32604.0
1,PHI,Adu,Freddy,M,475884.0,594884.0
2,RSL,Agorsor,Christopher,F,32604.0,32604.0
3,NY,Agudelo,Juan,F,55000.0,85000.0
4,KC,Aiyegbusi,Olukorede,D,42000.0,42000.0
...,...,...,...,...,...,...
520,CHV,Zemanski,Ben,M,44000.0,44000.0
521,NE,Zerka,Monsef,M-F,216000.0,226000.0
522,POR,Zizzo,Sal,F,65000.0,73250.0
523,SJ,Zura,Edmundo,F,48000.0,48000.0
524,KC,Zusi,Graham,F-M,42000.0,42000.0

In [2]:
df['full_name'] = df['first_name'] + ' ' + df['last_name'] + ' ' + df['club']
df_agrupado = df.groupby('full_name', as_index=False)['base_salary'].max()
df_agrupado = df_agrupado.sort_values(by='base_salary', ascending=False)
df_agrupado

               full_name  base_salary
138     David Beckham LA   5500000.08
489     Thierry Henry NY   5000000.04
411    Rafael Marquez NY   4600000.00
418      Robbie Keane LA   2917241.40
311    Landon Donovan LA   2300000.00
..                   ...          ...
182      Evan Newton HOU     32600.00
171  Ellis McLoughlin SJ     32600.00
337       Matt Kassel NY     32600.00
389      Orr Barouch CHI     32600.00
417  Richard Sanchez DAL     32600.00

[524 rows x 2 columns]

In [3]:
df_agrupado = df.groupby('position')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

position
F      205527.192479
M-F    161130.000000
M/F    147750.000000
M      141482.138208
D      118390.593143
M-D    102100.505000
GK      95816.703860
D-M     76770.833333
F-M     53875.000000
M/D     50000.000000
MF      42000.000000
Name: base_salary, dtype: float64

In [5]:
df_agrupado = df.groupby('club')['base_salary'].mean()
df_agrupado.sort_values(ascending=False)

club
LA      427674.082667
NY      405904.485161
TFC     175504.064516
PHI     119622.583333
VAN     118899.902667
HOU     117660.618462
CHV     115386.689655
RSL     113308.884615
DC      109588.395185
KC      103651.000000
CLB     100137.437333
NE       99944.555556
COL      99715.266667
SEA      97844.870968
DAL      95461.800000
SJ       89679.725517
CHI      84610.134667
POR      79298.968276
TOR      61798.000000
POOL     42000.000000
Name: base_salary, dtype: float64

In [6]:
df['base_salary'].mean()

142840.14405714284

In [7]:
df_filtered = df[df['base_salary'] < 1500000]
df_filtered['base_salary'].mean()

101753.05994219653